
INSERT INTO disciplines(discipline_name, lesson_type)
	VALUES
('Общая физика', 'Лекция'),
('Общая физика', 'Практика'),
('Термодинамика', 'Лабораторные работы'),
('Информатика', 'Лекция'),
('Информатика', 'Практика'),
('Математический анализ', 'Лекция'),
('Математический анализ', 'Практика'),
('Базы данных и экспертные системы', 'Лекция'),
('Технологии сетевого программирования', 'Лекция');

INSERT INTO teachers(teacher_name, teacher_login, teacher_password,
		academic_degree, academic_rank, department)
	VALUES
('Безруков Александр Васильевич', 'bezrukov', '97303',
	'Д.ф.-м.н.', 'Профессор', 'ПМ'),
/* 97303 == 'bav'.hashCode(); */
('Егорова Надежда Александровна', 'egorova', '100568',
	NULL, 'Доцент', 'ПФ'),
/* 100568 == 'ena'.hashCode(); */
('Галкин Виктор Валерьевич', 'galkin', '102759',
	NULL, 'Доцент', 'ПФ'),
/* 102759 == 'gvv'.hashCode(); */
('Преснякова Екатерина Дмитриевна', 'presnyakova', '110863',
	'Д.ф.-м.н.', 'Профессор', 'ПФ'),
/* 110863 == 'ped'.hashCode(); */
('Кряжев Павел Александрович', 'kryazhev', '106396',
	NULL, 'Доцент', 'Геоинформатики'),
/* 106396 == 'kpa'.hashCode(); */
('Смирнов Виктор Андреевич', 'smirnov', '114270',
	'К.ф.-м.н', 'Доцент', 'ПФ'),
/* 114270 == 'sva'.hashCode(); */
('Солянников Руслан Романович', 'solyannikov', '114163',
	NULL, 'Ассистент', 'Геоинформатики');
/* 114163 == 'srr'.hashCode(); */

INSERT INTO teachers_and_disciplines
	VALUES (4, 1), (6, 1), (3, 2), (2, 3), (5, 4), (7, 5), (1, 6), (1, 7);

INSERT INTO groups(group_number)
	VALUES ("6406"), ("6407"), ("6408"), ("6409");

INSERT INTO students(student_name, student_login, student_password, group_id)
	VALUES
('Егоров Станислав Иванович', 'egorov646', '100731', 1),
/* 100731 == 'esi'.hashCode(); */
('Закаулкин Станислав Викторович', 'zakaulkin646', '120925', 1),
/* 120925 == 'zsv'.hashCode(); */
('Юзакиев Руслан Романович', 'yuzakiev647', '3720796', 2),
/* 3720796 == 'yurr'.hashCode(); */
('Замуров Рустам Фатихович', 'zamurov647', '120878', 2),
/* 120878 == 'zrf'.hashCode(); */
('Иванов Иван Иванович', 'ivanov648', '104265', 3),
/* 104265 == 'iii'.hashCode(); */
('Коржиков Валентин Эдуардович', 'korzhikov648', '106586', 3);
/* 106586 == 'kve'.hashCode(); */

INSERT INTO timetable_records
	VALUES
(1, 0, 'вторник', 4, 3, '212-1'),
(1, 0, 'понедельник', 1, 1, '321-2'),
(1, 0, 'понедельник', 2, 2, '323-2'),
(1, 0, 'пятница', 3, 6, '231-2'),
(1, 1, 'вторник', 2, 4, '317-1'),
(2, 0, 'понедельник', 2, 1, '312-1'),
(2, 0, 'среда', 2, 4, '312-1'),
(2, 1, 'понедельник', 2, 4, '317-1'),
(2, 1, 'среда', 2, 6, '319-1'),
(3, 0, 'суббота', 1, 1, '321-2'),
(3, 1, 'суббота', 1, 2, '323-2');

INSERT INTO administrator
	(administrator_name, administrator_login, administrator_password)
VALUES ('Медведев Владимир Николаевич', 'admin', '1509442');
/* 1509442 == '1234'.hashCode(); */
